app/models/post.rb

INSERT INTO `posts` (`id`, `title`, `body`, `created_at`, `updated_at`) VALUES (11, 'wego', 'wego', '2020-10-21 11:19:36.808084', '2020-10-21 11:19:36.808084')
---
    def self.push(raw_post)
        puts raw_post.to_s
        raw_post = JSON.parse(raw_post)
        post = Post.new
        post.id = raw_post['id']
        post.title = raw_post['title']
        post.body = raw_post['body']
        post.save!